"""keep_defalut_na=False, na_values=['']"""

In [1]:
import pandas as pd

In [3]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [22]:
titles = pd.read_csv('data/titles.csv')
titles.head()

              title  year
0  #1 Serial Killer  2013
1              #211  2018
2                #5  2013
3        #50Fathers  2015
4               #66  2015

In [5]:
t = titles.sample(15)
t

                                 title  year
54195                           Desire  1936
104798                     Jaam sau ji  1983
5436                A Thousand Junkies  2017
170696                    Peacock (II)  2013
239067              The Woman in White  1929
195602                       Sexy Shop  2014
120159                 L'inaugurazione  2009
136707                      Lu ding ji  1992
12052               Almost a Gentleman  1939
152862                My Name Is Viola  2013
269392  À la recherche d'Étienne Brûlé  2011
1382          23rd March 1931: Shaheed  2002
110443               Kaettekita gokudô  1968
978                               180°  2001
187949                Rusty's Birthday  1949

In [6]:
titles.tail()

                                     title  year
270338                             Þrestir  2015
270339                        Þriðja nafni  2003
270340                              ärtico  2014
270341  è solo questione di punti di vista  2012
270342           è solo questione di tempo  2013

In [7]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270343 entries, 0 to 270342
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   270342 non-null  object
 1   year    270343 non-null  int64
dtypes: int64(1), object(1)
memory usage: 4.1+ MB

In [10]:
t['year']

54195     1936
104798    1983
5436      2017
170696    2013
239067    1929
195602    2014
120159    2009
136707    1992
12052     1939
152862    2013
269392    2011
1382      2002
110443    1968
978       2001
187949    1949
Name: year, dtype: int64

In [12]:
t.year.sort_values()

239067    1929
54195     1936
12052     1939
187949    1949
110443    1968
104798    1983
136707    1992
978       2001
1382      2002
120159    2009
269392    2011
170696    2013
152862    2013
195602    2014
5436      2017
Name: year, dtype: int64

In [18]:
t[(t.year <= 1999) & (t.year >= 1980)]

              title  year
104798  Jaam sau ji  1983
136707   Lu ding ji  1992

In [21]:
t[~t.year.between(1980,1999)]

                                 title  year
54195                           Desire  1936
5436                A Thousand Junkies  2017
170696                    Peacock (II)  2013
239067              The Woman in White  1929
195602                       Sexy Shop  2014
120159                 L'inaugurazione  2009
12052               Almost a Gentleman  1939
152862                My Name Is Viola  2013
269392  À la recherche d'Étienne Brûlé  2011
1382          23rd March 1931: Shaheed  2002
110443               Kaettekita gokudô  1968
978                               180°  2001
187949                Rusty's Birthday  1949

In [23]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [25]:
cast.sample(5)

,title,year,name,type,character,n
1544752,Jeanne la Pucelle II - Les prisons,1994,Xavier Maly,actor,Xaintrailles,19.0
1013364,A Fight for Survival,2010,Austin Handfield,actor,Austin,8.0
1693561,"Edison, the Man",1940,Bruce Mitchell,actor,Coachman,NaN
1738007,It Could Happen to You,1939,James C. Morton,actor,Detective,NaN
3947950,Schism,2008,Darcy Stoltzfus,actress,Cricket,15.0

In [26]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4136497 entries, 0 to 4136496
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 189.4+ MB

In [31]:
float("nan") <= 4

False

In [32]:
c = cast.sample(15)

In [35]:
c[c.n.isna()]

,title,year,name,type,character,n
2086545,Black Widows,2016,Travis Richardson,actor,Officer Madison,NaN
1615838,Red Rock Outlaw,1949,Billy McCoy,actor,Deputy,NaN
3256517,Float,2008,Jacquelin Marie Hahn,actress,Restaurant Patron,NaN
2757969,Un taxi pour Tobrouk,1961,Enrique Ávila,actor,German Soldier Playing Cards,NaN
955508,Kidnap Party,2012,Jeff Greenwald,actor,Partier,NaN
1713953,Meet Me After the Show,1951,Ralph Montgomery,actor,Photographer at Benefit,NaN
2484343,Tilt,2011,Simon Todorov,actor,Skater,NaN
2958790,The Longest Night,1936,Louise Carver,actress,Scrubwoman Swinging Mop,NaN

In [36]:
c.sort_values('year')

,title,year,name,type,character,n
2958790,The Longest Night,1936,Louise Carver,actress,Scrubwoman Swinging Mop,NaN
1615838,Red Rock Outlaw,1949,Billy McCoy,actor,Deputy,NaN
1713953,Meet Me After the Show,1951,Ralph Montgomery,actor,Photographer at Benefit,NaN
2757969,Un taxi pour Tobrouk,1961,Enrique Ávila,actor,German Soldier Playing Cards,NaN
452758,Bikini Beach,1964,Roger (II) Christian,actor,Surfer,35.0
3392554,Carry Me Back,1982,Yvette Kennedy,actress,Nightclub Hostess,18.0
2327575,Horká kase,1989,Vojtech Smísek,actor,Martin,24.0
3694223,Doing Time for Patsy Cline,1997,Miranda Otto,actress,Patsy,2.0
2358184,Mon voyage d'hiver,2003,Andreas Staier,actor,The Pianist,3.0
3619305,Keeping Mum,2005,Vivienne Moore,actress,Mrs. Martin,12.0
3256517,Float,2008,Jacquelin Marie Hahn,actress,Restaurant Patron,NaN
2484343,Tilt,2011,Simon Todorov,actor,Skater,NaN
955508,Kidnap Party,2012,Jeff Greenwald,actor,Partier,NaN
943242,Criteria One,2015,Rufus Graham,actor,Knight,5.0
2086545,Black Widows,2016,Travis Richardson,actor,Officer Madison,NaN

In [37]:
c.iloc[2:6]

,title,year,name,type,character,n
3619305,Keeping Mum,2005,Vivienne Moore,actress,Mrs. Martin,12.0
1615838,Red Rock Outlaw,1949,Billy McCoy,actor,Deputy,NaN
3256517,Float,2008,Jacquelin Marie Hahn,actress,Restaurant Patron,NaN
2757969,Un taxi pour Tobrouk,1961,Enrique Ávila,actor,German Soldier Playing Cards,NaN

### How many movies are listed in the titles dataframe?

### What are the earliest two films listed in the titles dataframe?

### How many movies have the title "Hamlet"?

### How many movies are titled "The Princess Bride"?

### When was the first movie titled "Hamlet" made?

### List all of the "Treasure Island" movies from earliest to most recent.

### How many movies were made in the year 1950?

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

### In what years has a movie titled "Batman" been released?

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "The Princess Bride" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1953 film "Peter Pan".

### Now display the entire cast, in "n"-order, of the 2003 version of "Peter Pan".

### How many roles (the number of lines in the cast dataframe) were in the 1921 version of Hamlet (Which was a silent movie)?

### How many roles were in 1996 Hamlet (Directed by Branagh)?

### How many "Hamlet" roles (**Hamlet** as a **character**) have been listed in all film credits through history?

### How many people have played a role (a character) called "The Dude"?

### How many people have played a character called "Ophelia"?

### How many roles has Mike Myers played throughout his career?

### How many roles has Uma Thurman played?

### List the supporting roles (having n=2) played by Uma Thurman in the 1990s, in order by year.

### List the leading roles (having n=1) played by Uma Thurman in the 1990s, in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?